# Customer Segmentation - CLV

## Problem statement

###### “What are the identifiable customer segments based on their Life Value?”

## Hypothesis generation

Feature list considered for clustering
* ARPU
* network Age

## Data exploration / transformation

In [6]:
% pylab inline 

import pandas as pd
import numpy as np

from sklearn.cluster import KMeans

Populating the interactive namespace from numpy and matplotlib

In [7]:
# reading the sample data
df = pd.read_csv('CLV.csv')

In [9]:
df = df.fillna(0)
df = df.query('NTWAGE >0')
df.head(n=2)

,ChargingPartyNumber,Jun17_Recharge,May17_Recharge,apr17_Recharge,Mar17_Recharge,Feb17_Recharge,Jan17_Recharge,NTWAGE
0,185268358,300.0,500.0,300.0,650.0,650.0,650.0,25
1,156082377,0.0,100.0,100.0,498.0,100.0,0.0,6

In [10]:
df.shape

(6303261, 8)

In [11]:
df['REV']=df.loc[:,'Jun17_Recharge':'Jan17_Recharge'].sum(axis=1)

In [12]:
df.head()

,ChargingPartyNumber,Jun17_Recharge,May17_Recharge,apr17_Recharge,Mar17_Recharge,Feb17_Recharge,Jan17_Recharge,NTWAGE,REV
0,185268358,300.0,500.0,300.0,650.0,650.0,650.0,25,3050.0
1,156082377,0.0,100.0,100.0,498.0,100.0,0.0,6,798.0
2,214357165,450.0,100.0,100.0,200.0,0.0,150.0,25,1000.0
3,212055844,300.0,150.0,200.0,300.0,150.0,250.0,25,1350.0
4,182348793,900.0,200.0,0.0,0.0,0.0,0.0,3,1100.0

In [13]:
df['ARPU']=df['REV']/df['NTWAGE']
df.loc[df['NTWAGE']>6,'ARPU'] = df[df['NTWAGE']>6]['REV']/6
df['ARPU']=df['ARPU'].round()
df.head()

,ChargingPartyNumber,Jun17_Recharge,May17_Recharge,apr17_Recharge,Mar17_Recharge,Feb17_Recharge,Jan17_Recharge,NTWAGE,REV,ARPU
0,185268358,300.0,500.0,300.0,650.0,650.0,650.0,25,3050.0,508.0
1,156082377,0.0,100.0,100.0,498.0,100.0,0.0,6,798.0,133.0
2,214357165,450.0,100.0,100.0,200.0,0.0,150.0,25,1000.0,167.0
3,212055844,300.0,150.0,200.0,300.0,150.0,250.0,25,1350.0,225.0
4,182348793,900.0,200.0,0.0,0.0,0.0,0.0,3,1100.0,367.0

In [14]:
df = df[['ChargingPartyNumber','NTWAGE','ARPU']]
df.head()

   ChargingPartyNumber  NTWAGE   ARPU
0            185268358      25  508.0
1            156082377       6  133.0
2            214357165      25  167.0
3            212055844      25  225.0
4            182348793       3  367.0

In [15]:
df = df.query('ARPU>0')
bins = [0,100,200,300,400,500,600,700,800,900,1000,float("inf")]
group_names = ['100','200','300','400','500','600','700','800','900','1000','1000+']
df['ARPU_CAT']=pd.cut(df['ARPU'],bins, labels=group_names)
df.head()

   ChargingPartyNumber  NTWAGE   ARPU ARPU_CAT
0            185268358      25  508.0      600
1            156082377       6  133.0      200
2            214357165      25  167.0      200
3            212055844      25  225.0      300
4            182348793       3  367.0      400

In [16]:
bins = [0,3,6,12,24,60,120,float("inf")]
group_names = ['3','6','12','24','60','120','120+']
df['NTWAGE_CAT']=pd.cut(df['NTWAGE'],bins, labels=group_names)
df.head()

   ChargingPartyNumber  NTWAGE   ARPU ARPU_CAT NTWAGE_CAT
0            185268358      25  508.0      600         60
1            156082377       6  133.0      200          6
2            214357165      25  167.0      200         60
3            212055844      25  225.0      300         60
4            182348793       3  367.0      400          3

In [17]:
df.to_csv('clvAthena.csv',index=False)